kossnikita/at32f4xx-pac/src/at32f415/at32f415.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOB</name>
      <baseAddress>0x40010C00</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOC</name>
      <baseAddress>0x40011000</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOD</name>
      <baseAddress>0x40011400</baseAddress>
    </peripheral>
    <peripheral derivedFrom="GPIOA">
      <name>GPIOF</name>
      <baseAddress>0x40011C00</baseAddress>
    </peripheral>
    <peripheral>
      <name>IOMUX</name>
      <description>IO MUX function</description>
      <groupName>IOMUX</groupName>
      <baseAddress>0x40010000</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x400</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>EVTOUT</name>
          <displayName>EVTOUT</displayName>
          <description>Event output register
          (IOMUX_EVTOUT)</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SELPIN</name>
              <description>Select pin</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>15</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>SELPORT</name>
              <description>Select port</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SELPORT</name>
                <enumeratedValue>
                  <name>GPIOA</name>
                  <description>GPIOA</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOB</name>
                  <description>GPIOB</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOC</name>
                  <description>GPIOC</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOD</name>
                  <description>GPIOD</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOF</name>
                  <description>GPIOF</description>
                  <value>6</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>EVOEN</name>
              <description>Event output enable</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>EVOEN</name>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>Disable</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enable</name>
                  <description>Enable</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP</name>
          <displayName>REMAP</displayName>
          <description>IO MUX remap register</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI1_MUX0</name>
              <description>SPI1 muxing bit0</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <writeConstraint>
                <range>
                  <minimum>0</minimum>
                  <maximum>0</maximum>
                </range>
              </writeConstraint>
            </field>
            <field>
              <name>I2C1_MUX</name>
              <description>I2C1 muxing</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>I2C1_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>SCL/PB6, SDA/PB7 SMBA/PB5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>SCL/PB8, SDA/PB9 SMBA/PB5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART1_MUX</name>
              <description>USART1 muxing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USART1_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TX/PA9, RX/PA10</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TX/PB6, RX/PB7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART3_MUX</name>
              <description>USART3 muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USART3_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>TX/PA7, RX/PA6, CK/PA5, CTS/PB1, RTS/PB0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1_MUX</name>
              <description>TMR1 muxing</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TMR1_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PB12, CH1C/PB13, CH2C/PB14, CH3C/PB15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR2_MUX</name>
              <description>TMR2 muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TMR2_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/EXT/PA0, CH2/PA1, CH3/PA2, CH4/PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/EXT/PA15, CH2/PB3, CH3/PA2, CH4/PA3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CH1/EXT/PA0, CH2/PA1, CH3/PB10, CH4/PB11</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>CH1/EXT/PA15, CH2/PB3, CH3/PB10, CH4/PB11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR3_MUX</name>
              <description>TMR3 muxing</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TMR3_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PA6, CH2/PA7, CH3/PB0 and CH4/PB1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CH1/EXT/PA0, CH2/PA1, CH3/PB10, CH4/PB11</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>CH1/EXT/PA15, CH2/PB3, CH3/PB10, CH4/PB11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN_MUX</name>
              <description>CAN1 muxing</description>
              <bitOffset>13</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CAN_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>RX/PA11, TX/PA12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>RX/PB8, TX/PB9</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PD01_MUX</name>
              <description>PD0/PD1 muxing on OSCIN/OSCOUT</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PD01_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>Not PD0 and PD1 mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEXT</name>
                  <description>PD0 is mapped to HEXT_IN, while PD1 to HEXT_OUT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR5CH4_MUX</name>
              <description>TMR5 channel4 internal muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>TMR5CH4_MUX</name>
                <enumeratedValue>
                  <name>PA3</name>
                  <description>TMR5_CH4 is connected to PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LICK</name>
                  <description>TMR5_CH4 is connected to LICK. LICK can be calibrated</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1_ETP_MUX</name>
              <description>ADC1 external trigger preempted conversion muxing</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADC1_ETP_MUX</name>
                <enumeratedValue>
                  <name>EXINT15</name>
                  <description>ADC1 external trigger preempted conversion is connected to EXINT15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1CH4</name>
                  <description>ADC1 external trigger preempted conversion is connected to TMR1 channel 4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1_ETO_MUX</name>
              <description>ADC1 external trigger ordinary conversion muxing</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADC1_ETO_MUX</name>
                <enumeratedValue>
                  <name>EXINT11</name>
                  <description>ADC1 external trigger ordinary conversion is connected to EXINT11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1_TRGO</name>
                  <description>ADC1 external trigger ordinary conversion TMR1_TRGO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWJTAG_MUX</name>
              <description>SWD JTAG muxing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SWJTAG_MUX</name>
                <enumeratedValue>
                  <name>SWDandJTAG</name>
                  <description>Supports SWD and JTAG. All SWJTAG pins cannot be used as GPIOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDandJTAGwithoutNJTRST</name>
                  <description>Supports SWD and JTAG. NJTRST is disabled. PB4 can be used as GPIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD</name>
                  <description>Supports SWD but JTAG is disabled. PA15/PB3/PB4 can be used as GPIOs</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>SWD and JTAG are disabled. All SWJTAG pins can be used as GPIOs</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1_MUX1</name>
              <description>SPI1 muxing bit1</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SPI1_MUX1</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7, MCK/PB0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5,MCK/PB6</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC1</name>
          <displayName>EXINTC1</displayName>
          <description>External interrupt configuration register 1
          (IOMUX_EXINTC1)</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>0-3</dimIndex>
              <name>EXINT%s</name>
              <description>Select the input source for EXINT%s external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EXINT0</name>
                <enumeratedValue>
                  <name>GPIOA</name>
                  <description>GPIOA pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOB</name>
                  <description>GPIOB pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOC</name>
                  <description>GPIOB pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOD</name>
                  <description>GPIOB pin</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOF</name>
                  <description>GPIOB pin</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC2</name>
          <displayName>EXINTC2</displayName>
          <description>External interrupt configuration register 2
          (IOMUX_EXINTC2)</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>4-7</dimIndex>
              <name>EXINT%s</name>
              <description>Select the input source for EXINT%s external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EXINT4</name>
                <enumeratedValue>
                  <name>GPIOA</name>
                  <description>GPIOA pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOB</name>
                  <description>GPIOB pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOC</name>
                  <description>GPIOB pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOD</name>
                  <description>GPIOB pin</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOF</name>
                  <description>GPIOB pin</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>EXINTC3</name>
          <displayName>EXINTC3</displayName>
          <description>External interrupt configuration register 3
          (IOMUX_EXINTC3)</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>8-11</dimIndex>
              <name>EXINT%s</name>
              <description>Select the input source for EXINT%s external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EXINT8</name>
                <enumeratedValue>
                  <name>GPIOA</name>
                  <description>GPIOA pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOB</name>
                  <description>GPIOB pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOC</name>
                  <description>GPIOB pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOD</name>
                  <description>GPIOB pin</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOF</name>
                  <description>GPIOB pin</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
