kossnikita/at32f4xx-pac/src/at32f415/at32f415.svd
        <register>
          <name>EXINTC4</name>
          <displayName>EXINTC4</displayName>
          <description>External interrupt configuration register 4
          (IOMUX_EXINTC4)</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <dim>4</dim>
              <dimIncrement>0x4</dimIncrement>
              <dimIndex>12-15</dimIndex>
              <name>EXINT%s</name>
              <description>Select the input source for EXINT%s external interrupt</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>EXINT12</name>
                <enumeratedValue>
                  <name>GPIOA</name>
                  <description>GPIOA pin</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOB</name>
                  <description>GPIOB pin</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOC</name>
                  <description>GPIOB pin</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOD</name>
                  <description>GPIOB pin</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPIOF</name>
                  <description>GPIOB pin</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP2</name>
          <displayName>REMAP2</displayName>
          <description>IO MUX remap register 2</description>
          <addressOffset>0x1C</addressOffset>
          <size>0x20</size>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CMP_MUX</name>
              <description>CMP internal muxing</description>
              <bitOffset>26</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>CMP_MUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CMP1_OUT is connected to PA0, CMP2_OUT is connected to PA2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CMP1_OUT is connected to PA6, CMP2_OUT is connected to PA7</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CMP1_OUT is connected to PA11, CMP2_OUT is connected to PA12;</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP3</name>
          <displayName>REMAP3</displayName>
          <description>IO MUX remap register 3</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMR11_GMUX</name>
              <description>TMR11 muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TMR11_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PB9</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/PA7</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR10_GMUX</name>
              <description>TMR10 muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TMR10_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PB8</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/PA6</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR9_GMUX</name>
              <description>TMR9 muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TMR9_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PA2, CH2/PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/PB14, CH2/PB15</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP4</name>
          <displayName>REMAP4</displayName>
          <description>IO MUX remap register 4</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMR5CH4_GMUX</name>
              <description>TMR5CH4 muxing</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>TMR5CH4_GMUX</name>
                <enumeratedValue>
                  <name>PA3</name>
                  <description>TMR5_CH4 is connected to PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LICK</name>
                  <description>LICK is connected to TMR5_CH4 to get calibration</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR5_GMUX</name>
              <description>TMR5 muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>TMR5_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PA0 CH2/PA1 CH3/PA2 CH4/PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/PF4 CH2/PF5 CH3/PA2 CH4/PA3</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR3_GMUX</name>
              <description>TMR3 muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TMR3_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1/PA6 CH2/PA7 CH3/PB0 CH4/PB1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1/PB4 CH2/PB5 CH3/PB0 CH4/PB1</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR2_GMUX</name>
              <description>TMR2 muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>TMR2_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CH1_EXT/PA0 CH2/PA1 CH3/PA2 CH4/PA3</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CH1_EXT/PA15 CH2/PB3 CH3/PA2 CH4/PA3</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CH1_EXT/PA0 CH2/PA1 CH3/PB10 CH4/PB11</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>CH1_EXT/PA15 CH2/PB3 CH3/PB10 CH4/PB11</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1_GMUX</name>
              <description>TMR1 muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>TMR1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PB12, CH1C/PB13, CH2C/PB14, CH3C/PB15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>EXT/PA12, CH1/PA8, CH2/PA9, CH3/PA10, CH4/PA11, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>EXT/PA0, CH1/PC6, CH2/PC7, CH3/PC8, CH4/PC9, BRK/PA6, CH1C/PA7, CH2C/PB0, CH3C/PB1</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP5</name>
          <displayName>REMAP5</displayName>
          <description>IO MUX remap register 5</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SPI2_GMUX</name>
              <description>SPI2 muxing</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SPI2_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CS/PB12, SCK/PB13, MISO/PB14, MOSI/PB15, MCK/PC6</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PC7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPI1_GMUX</name>
              <description>SPI1 muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SPI1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>CS/PA4, SCK/PA5, MISO/PA6, MOSI/PA7, MCK/PB0</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>CS/PA15, SCK/PB3, MISO/PB4, MOSI/PB5, MCK/PB6</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C2_GMUX</name>
              <description>I2C2 muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>I2C2_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>SCL/PB10, SDA/PB11, SMBA/PB12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>SCL/PA8, SDA/PC9, SMBA/PA9</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>SCL/PA8, SDA/PB4, SMBA/PA9</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>SCL/PF6, SDA/PF7, SMBA/PA9</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>I2C1_GMUX</name>
              <description>I2C1 muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>I2C1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>SCL/PB6, SDA/PB7, SMBA/PB5</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>SCL/PB8, SDA/PB9, SMBA/PB5</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>SCL/PF6, SDA/PF7, SMBA/PB5</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP6</name>
          <displayName>REMAP6</displayName>
          <description>IO MUX remap register 6</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>UART4_GMUX</name>
              <description>UART4 muxing</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>UART4_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TX/PC10 RX/PC11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TX/PF4 RX/PF5</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART3_GMUX</name>
              <description>USART3 muxing</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>USART3_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TX/PB10, RX/PB11, CK/PB12, CTS/PB13, RTS/PB14</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TX/PC10, RX/PC11, CK/PC12, CTS/PB13, RTS/PB14</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>TX/PA7, RX/PA6, CK/PA5, CTS/PB1 RTS/PB0</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USART1_GMUX</name>
              <description>USART1 muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>USART1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TX/PA9, RX/PA10</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TX/PB6, RX/PB7</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDIO1_GMUX</name>
              <description>SDIO1 muxing</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>SDIO1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>D0/PC8, D1/PC9, D2/PC10, D3/PC11, D4/PB8, D5/PB9, D6/PC6, D7/PC7, CK/PC12, CMD/PD2</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>D0/PC0, D1/PC1, D2/PC2, D3/PC3, D4/PA4, D5/PA5, D6/PA6, D7/PA7, CK/PC4, CMD/PC5</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>D0/PA4, D1/PA5, D2/PA6, D3/PA7, CK/PC4, CMD/PC5</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>D0/PC0, D1/PC1, D2/PC2, D3/PC3, D4/PA4, D5/PA5, D6/PA6, D7/PA7, CK/PA2, CMD/PA3</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX4</name>
                  <description>D0/PA4, D1/PA5, D2/PA6, D3/PA7, CK/PA2, CMD/PA3</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CAN1_GMUX</name>
              <description>CAN1 muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <enumeratedValues>
                <name>CAN1_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>RX/PA11, TX/PA12</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>RX/PB8, TX/PB9</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
