kossnikita/at32f4xx-pac/src/at32f415/at32f415.svd
        <register>
          <name>REMAP7</name>
          <displayName>REMAP7</displayName>
          <description>IO MUX remap register 7</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>PD01_GMUX</name>
              <description>PortD0/PortD1 muxing on OSC_IN/OSC_OUT</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>PD01_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>Not PD0 and PD1 mapping</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HEXT</name>
                  <description>PD0 is mapped to HEXT_IN, while PD1 to HEXT_OUT</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SWJTAG_GMUX</name>
              <description>Serial wire JTAG muxing</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <enumeratedValues>
                <name>SWJTAG_GMUX</name>
                <enumeratedValue>
                  <name>SWDandJTAG</name>
                  <description>Supports SWD and JTAG. All SWJTAG pins cannot be used as GPIOs</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWDandJTAGwithoutNJTRST</name>
                  <description>Supports SWD and JTAG. NJTRST is disabled. PB4 can be used as GPIO</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SWD</name>
                  <description>Supports SWD but JTAG is disabled. PA15/PB3/PB4 can be used as GPIOs</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Disable</name>
                  <description>SWD and JTAG are disabled. All SWJTAG pins can be used as GPIOs</description>
                  <value>4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1_ETO_GMUX</name>
              <description>ADC1 external trigger ordinary conversion muxing</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADC1_ETO_GMUX</name>
                <enumeratedValue>
                  <name>EXINT11</name>
                  <description>ADC1 external trigger ordinary conversion is connected to EXINT11</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1_TRGO</name>
                  <description>ADC1 external trigger ordinary conversion TMR1_TRGO</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC1_ETP_GMUX</name>
              <description>ADC1 external trigger preempted conversion muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <enumeratedValues>
                <name>ADC1_ETP_GMUX</name>
                <enumeratedValue>
                  <name>EXINT15</name>
                  <description>ADC1 external trigger preempted conversion is connected to EXINT15</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TMR1CH4</name>
                  <description>ADC1 external trigger preempted conversion is connected to TMR1 channel 4</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>REMAP8</name>
          <displayName>REMAP8</displayName>
          <description>IO MUX remap register 8</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TMR3_CH1_CMP_GMUX</name>
              <description>TMR3 CH1 CMP muxing</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TMR3_CH1_CMP_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TMR3_GMUX IO signal is connected to TMR3 channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TMR3_GMUX IO signal is connected to TMR3 channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CMP output signal is connected to TMR3 channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>Either CMP output signal or TMR3_GMUX IO signal is connected to TMR3 channel 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR2_CH4_CMP_GMUX</name>
              <description>TMR2 CH4 CMP muxing</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TMR2_CH4_CMP_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TMR2_GMUX IO signal is connected to TMR2 channel 4</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TMR2_GMUX IO signal is connected to TMR2 channel 4</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CMP output signal is connected to TMR2 channel 4</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>Either CMP output signal or TMR1_GMUX IO signal is connected to TMR2 channel 4</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1_CH1_CMP_GMUX</name>
              <description>TMR1 CH1 CMP muxing</description>
              <bitOffset>2</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TMR1_CH1_CMP_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TMR1_GMUX IO signal is connected to TMR1 channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TMR1_GMUX IO signal is connected to TMR1 channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CMP output signal is connected to TMR1 channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>Either CMP output signal or TMR1_GMUX IO signal is connected to TMR1 channel 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TMR1_BK1_CMP_GMUX</name>
              <description>TMR1 BK1 CMP muxing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <enumeratedValues>
                <name>TMR1_BK1_CMP_GMUX</name>
                <enumeratedValue>
                  <name>MUX0</name>
                  <description>TMR1_GMUX IO signal is connected to TMR1 break channel 1</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX1</name>
                  <description>TMR1_GMUX IO signal is connected to TMR1 break channel 1</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX2</name>
                  <description>CMP output signal is connected to TMR1 break channel 1</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MUX3</name>
                  <description>Either CMP output signal or TMR1_GMUX IO signal is connected to TMR1 break channel 1</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
